; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.9.0
; Author:       Yurii Petrashko (aka YuriPet) <yuripet@gmail.com>
; Homepage:
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode format (UTF-16) and Zip it to preserve formatting
;	E-mail new language files to gora@7zsfx.info for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents of each %s variable is hardcoded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
1=Файл
2=Опції 1
3=Довідка
4=Cпо&чатку перевіряти як SFX архів
; ------------------------------------
5=Виберіть файл
6=&Архів (інсталятор), який слід розпакувати:
7=Виберіть папку призначення
8=&Папка, до якої буде здійснено розпакування:
9=Файл можна просто перетягнути сюди
; ------------------------------------
10=Опції %s
11=Зберігати &історію
12=Приховувати вікно &консолі
13=Пропонувати &оновлення:
14=&Мова:
15=Запам'ятати й не змінювати розмір &вікна
16=Н&е закривати вікно після розпакування
; ------------------------------------
17=Опції, специфічні для формату
18=&Запит перед запуском файлів
19=Видаляти &дублікати файлів
20=Видаляти &тимчасові файли
21=Додавати роз&ширення до файлів
22=Видаляти файл після &успішного розпакування
; ------------------------------------
23=Про програму
; ------------------------------------
24=Веб-сайти %s
25=Сайт офіційної версії
26=Форум модифікованої версії
; ------------------------------------
27=Оновлення
28=Востаннє наявність оновленнь перевірялась %s дн. тому!
29=Перевірити оновлення зараз?
30=Інте&грувати до оболонки
; ------------------------------------
31=&Розпакувати
32=З&берегти
33=О&новити
34=&Скасувати
35=Опції 2
; ------------------------------------
36=Розпакування %s
37=%s підтримує кілька методів розпакування %s. На жаль, жоден із цих методів не є надійним на 100%. Якщо обраний метод не працює, запустіть %s ще раз і виберіть інший метод.
; ------------------------------------
38=Метод розпакування
39=Адміністративна інсталяція %s
40=Розпакування %s
41=Ключ %s
42=Розпаковувач %s
43=Це не інсталятор InstallShield
44=Показати рез&юме після розпакування
; ------------------------------------
; GUI control functions
45=В&имкнути звуки програми
46=Версія 7-Zip
47=Не існує файлу:%n%s%n%nОберіть існуючий файл.
48=Відкрити файл
49=Зберігати до:
50=Усі
; Common terms
51=архіву
52=стиснутого файлу
53=Час: %s
54=електронної книги
55=електронної листівки
56=кодованого файлу
57=невідомого виконуваного файлу
58=Невдала ініціалізація
59=файлу довідки
60=виправлення
61=образу
62=інсталятора
63=модуля злиття
64=пакета
65=патча
66=SFX
67=етап
68=Вдала ініціалізація
69=Тестування
70=Видобування:
71=Розмір архіву
72=оновлення
73=Ім'я архіву
74=щотижня|кожні два тижні|щомісяця|ніколи
; Status messages
75=Аналіз типу файлу
76=Аналіз файлу %s скануванням
77=Видобування файлів із:
78=Очікування запуску інсталятора.%nЗачекайте
79=Для переривання видобування натисніть клавішу ESC%nЗгорнути/відновити вікно можна натисканням клавіші F11
; Custom prompts
80=%s CD-ROM образи неможливо розпакувати безпосередньо.%nОбраз буде перетворено на ISO CD-ROM образ,%nякий і буде розпаковано.%n%nБажаєте продовжити?%nПримітка: цей процес буде тривати кілька хвилин!
81=Помилка: Не вдається перетворити CD-ROM образ.
82=Помилка: ISO образ було створено з образу %s, але розпакувати його не вдалося.%nБажаєте зберегти ISO-образ для подальшого аналізу?
83=Помилка: Можливо це некоректний MHT-файл.%nНіяких меж не було виявлено.
84=%s. Вийдіть із інсталятора, потім натисніть 'OK', щоб продовжити.
85=Увага: цей метод працює лише з певними типами пакетів Wise Windows Installer.%nЯкщо Wise Installation Wizard запуститься і підвисне, значить цей файл не%nпідтримується.%nУ такому випадку закрийте інсталятор, і %s перерве розпакування.%n%nПродовжити розпакування?
86=Цей файл упаковано із %s стисненням. Можна продовжити розпакування його вмісту без %s розпаковування%nабо здійснити лише %s розпаковування.%n%nНатисніть кнопку 'Так' для розпакування без %s розпаковування.%n%nНатисніть кнопку 'Ні' для виконання тільки %s розпаковування.%n%nВ останньому випадку розпакований файл буде названо:%n%s
87=Помилка: %s%nне може бути розпакований.
88=Попередження: для видобування вмісту файлів цього типу, файл необхідно запустити.%nЯкщо ви продовжите, буде виконана така команда:%n%n%s%n%nЯкщо ви припускаєте, що цей файл, можливо, шкідливий, продовжувати не рекомендовано.%nВи бажаєте продовжити видобування?
89=Попередження: папка призначення %s вже існує!%nВидобування до не пустої папки може призвести до помилки розпаковування.%n%nОчистити папку перед розпаковуванням?
90=Для розпаковування потрібен пароль!%n%nВимкнути опцію '%s',%nщоб мати можливість ввести пароль?
91=Для розпаковування цього архіву потрібен додатковий%nрозпаковувач %s
; Help text
92=Видобування файлів з архіву або інсталятора будь-якого типу.%nВикористання:%n%s%n%nПідтримуються параметри:%n%s%t%tПоказати цю довідку%n%s%t%tВідкрити вкладку %s%n%s%tІм'я файлу, який потрібно розпакувати%n%s%tШлях\ім'я папки призначення%n%nЗазначення %s замість імені папки призначення змусить %n%s розпаковувати до папки з ім'ям архіву.%n%nПриклад:%s%n%nЯкщо запустити %s без параметрів, буде відображено основне вікно програми, в якому можна вказати ім'я файлу та обрати папку для розпаковування.
93=Розпакувати з використанням %s
; Error messages
94=Видобування %s неможливо записати до протоколу.
95=архіватором 7-Zip
96=%s неможливо розпакувати.%n%nТип файлу визначено, як %s%n%nНатисніть 'OK', якщо бажаєте аналізувати файл, або 'Скасувати', щоб вийти.
97=%s%nмає невідоме розширення і не може бути розпакований.
98=Неможливо створити папку:%n%s%nВиберіть правильний шлях.
99=Неможливо розпакувати %s. %nРозпаковування цього %s, можливо й підтримується, але воно закінчилося невдало.%nПодробиці - див. у файлі протоколу %s.%n%nНатисніть 'OK', щоб переглянути файл протоколу, або 'Скасувати', щоб вийти.
100=%t–= %s аналіз =–
; Update messages
101=Оновлення завершено
102=Розпочато оновлення, чекайте...
103=Завантаження файлів
104=Завантаження завершено!
105=Оновлено до версії: %s
106=%n%s буде перезапущено!
107=У вас інстальовано версію: %s%nОновлення не потрібне!
; ------------------------------------
108=Помилка завантаження
109=Не вдалося завантажити файл-список із сервера%nМожливо, відсутнє підключення до мережі%nабо сервер оновлень недоступний.
110=Помилка завантаження файлу
111=Помилка розпаковування файлу
112=При оновленні до версії %s%nсталися помилки, повторіть!!!
113=Виконано: %s із %s
114=Інформація
115=Версії розпакувальників
116=Відкрити папку розпакування?
117=Рядків у таблиці
118=Роздільник
119=Відкривати &лише верхній рівень архіву
120=Аналіз PE-файлів
121=Не вдалося обробити MSI-файл
122=Через 'глибоке' розташування цього MSI-пакета не вдалося розпакувати %s файлів.%nПодробиці див. у %s.%n%nПеремістіть MSI-пакет ближче до кореня диска і повторіть розпакування.%n%nНатисніть 'OK', щоб переглянути файл протоколу, або 'Скасувати', щоб вийти.
123=сигнатур -
124=Вибрати тип архіву вручну (зі списку)?
125=Виберіть сигнатуру можливого типу архіву
126=Спробуємо для розпакування 'TotalObserver'?